{
	"journal_list": [
		{
			"id": 0,
			"title": "Old Building",
			"entries": [
				{
					"id": 0,
					"title": "Locked Box",
					"line": "I somehow made it inside an old looking building. I can see a wooden box, with what looks to be a combination lock securing the contents. I should look around. Is that a calendar above it?"
				},
				{
					"id": 1,
					"title": "Book Hint",
					"line": "Found a message written in a book. It reads \"On the coming week, the Music Blasts, on the weekday before the Dance\"."
				},
				{
					"id": 2,
					"title": "Plant Hint",
					"line": "Found a hidden message on a plant pot. It reads \"On the 3rd Monday of March the Party Starts\"."
				},
				{
					"id": 3,
					"title": "Building Wall Hint",
					"line": "Found writing on the wall of one of the buildings. It reads \"On the Great Day of God, the Dance Starts\"."
				},
				{
					"id": 4,
					"title": "Book Hint",
					"line": "Found a message written in a book. It reads \"On the next Weekend, the Soldiers March\"."
				},
				{
					"id": 5,
					"title": "Plant Hint",
					"line": "Found a hidden message on a plant pot. It reads \"On the 1st Friday of February, the Grieving Starts\"."
				},
				{
					"id": 6,
					"title": "Building Wall Hint",
					"line": "Found writing on the wall of one of the buildings. It reads \"On God's Day, the Fallen Rests\"."
				},
				{
					"id": 7,
					"title": "Book Hint",
					"line": "Found a message written in a book. It reads \"On the 4th day of the week, the Transformation takes Control\"."
				},
				{
					"id": 8,
					"title": "Plant Hint",
					"line": "Found a hidden message on a plant pot. It reads \"On the last Monday of July, the Pain Starts\"."
				},
				{
					"id": 9,
					"title": "Building Wall Hint",
					"line": "Found writing on the wall of one of the buildings. It reads \"On the last day of the month, the Beast Begins the Hunt\"."
				},
				{
					"id": 10,
					"title": "Power Box",
					"line": "I found a power box in one of the rooms. It seems to be locked. Maybe I can find the key."
				}
			]
		},
		{
			"id": 1,
			"title": "Mysterious Dark Corridor",
			"entries": [
				{
					"id": 0,
					"title": "Appeared in a Long Candle-Lit Hallway",
					"line": "How did I get here? How do these portals work? I can't see an end to this hallway."
				},
				{
					"id": 1,
					"title": "Locked in a Closed Room",
					"line": "I turned around and before I knew it I'm being blocked by walls that I swear weren't there before. I need to get out! I should look around."
				},
				{
					"id": 2,
					"title": "Found a Tape",
					"line": "I found a tape labeled \"Interesting Refractions\". Maybe I can listen to it using the Tape Player on the desk."
				},
				{
					"id": 3,
					"title": "Listened to Tape",
					"line": "I played the \"Interesting Refractions\" tape. It seems to be somekind of a journal entry. It references a girl looking at a mirror. Is it the mirror in this room?"
				},
				{
					"id": 4,
					"title": "Mirror Reacted to Stare",
					"line": "I looked at the old mirror for a few seconds. It somehow... reacted! I swear, I can make out strange shapes in the glass. They weren't there before!"
				}
			]
		},
		{
			"id": 2,
			"title": "Station Maintenance Room",
			"entries": [
				{
					"id": 0,
					"title": "Entered a Maintanance Room",
					"line": "I managed to open the door, revealing some sort of maintenance room."
				},
				{
					"id": 1,
					"title": "Picked up an old coin",
					"line": "I picked up what seems to be an old coin. I can't tell whether it's real or not. Maybe I should search for more."
				},
				{
					"id": 2,
					"title": "Found a set of Slots",
					"line": "I found a set of slots. Maybe I can set the coins in them. But on what order though?"
				},
				{
					"id": 3,
					"title": "A Gate Appeared",
					"line": "After setting the coins into the correct slots, an ellipse-shaped gate materialized out of thin air! I can't see very far inside it, but it seems to shimmer and quiver in waves. Wonder where it leads."
				}
			]
		},
		{
			"id": 3,
			"title": "Rotating Rooms",
			"entries": [
				{
					"id": 0,
					"title": "Found a Keypad",
					"line": "I discovered a keypad outside what seems to be a garage-like door. I'll have to find the password somwhere."
				},
				{
					"id": 1,
					"title": "Wall Riddle",
					"line": "Found a riddle on the wall outside the weird rotating rooms. It reads \"Remember. The Container Room is Last, The Castle Walls are somewhere before the Classroom, and between them is the Cave\"."
				},
				{
					"id": 2,
					"title": "Classroom Hint",
					"line": "I found myself in a classroom. There was a lullaby written in the blackboard reading \"Are you sleeping, are you sleeping, brother John, brother John, Four morning bells are ringing, Four morning bells are ringing, Ding dang dong, ding dang dong\"."
				},
				{
					"id": 3,
					"title": "Barrel Room Hint",
					"line": "One of the rooms is a container full of barrels. There seems to be \"8\" of them."
				},
				{
					"id": 4,
					"title": "Rock Room Hint",
					"line": "I found a note on a rock with the number \"6\" on it."
				},
				{
					"id": 5,
					"title": "Clock Room Hint",
					"line": "Entered a room with a chair, a table and a clock on the latter, which reads \"9 o'clock\"."
				}
			]
		}
	]
}